{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "RBERT"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "finetuning_task": "semeval",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "P1001",
    "1": "P102",
    "10": "P1336",
    "11": "P1344",
    "12": "P136",
    "13": "P1365",
    "14": "P1366",
    "15": "P137",
    "16": "P1376",
    "17": "P140",
    "18": "P1412",
    "19": "P1441",
    "2": "P1056",
    "20": "P150",
    "21": "P155",
    "22": "P156",
    "23": "P159",
    "24": "P161",
    "25": "P162",
    "26": "P166",
    "27": "P17",
    "28": "P170",
    "29": "P171",
    "3": "P108",
    "30": "P172",
    "31": "P175",
    "32": "P176",
    "33": "P178",
    "34": "P179",
    "35": "P19",
    "36": "P190",
    "37": "P194",
    "38": "P20",
    "39": "P205",
    "4": "P112",
    "40": "P206",
    "41": "P22",
    "42": "P241",
    "43": "P25",
    "44": "P26",
    "45": "P264",
    "46": "P27",
    "47": "P272",
    "48": "P276",
    "49": "P279",
    "5": "P118",
    "50": "P30",
    "51": "P31",
    "52": "P3373",
    "53": "P35",
    "54": "P355",
    "55": "P36",
    "56": "P361",
    "57": "P364",
    "58": "P37",
    "59": "P39",
    "6": "P1198",
    "60": "P40",
    "61": "P400",
    "62": "P403",
    "63": "P449",
    "64": "P463",
    "65": "P488",
    "66": "P495",
    "67": "P50",
    "68": "P527",
    "69": "P54",
    "7": "P123",
    "70": "P551",
    "71": "P569",
    "72": "P57",
    "73": "P570",
    "74": "P571",
    "75": "P576",
    "76": "P577",
    "77": "P58",
    "78": "P580",
    "79": "P582",
    "8": "P127",
    "80": "P585",
    "81": "P6",
    "82": "P607",
    "83": "P674",
    "84": "P676",
    "85": "P69",
    "86": "P706",
    "87": "P710",
    "88": "P737",
    "89": "P740",
    "9": "P131",
    "90": "P749",
    "91": "P800",
    "92": "P807",
    "93": "P840",
    "94": "P86",
    "95": "P937"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "P1001": 0,
    "P102": 1,
    "P1056": 2,
    "P108": 3,
    "P112": 4,
    "P118": 5,
    "P1198": 6,
    "P123": 7,
    "P127": 8,
    "P131": 9,
    "P1336": 10,
    "P1344": 11,
    "P136": 12,
    "P1365": 13,
    "P1366": 14,
    "P137": 15,
    "P1376": 16,
    "P140": 17,
    "P1412": 18,
    "P1441": 19,
    "P150": 20,
    "P155": 21,
    "P156": 22,
    "P159": 23,
    "P161": 24,
    "P162": 25,
    "P166": 26,
    "P17": 27,
    "P170": 28,
    "P171": 29,
    "P172": 30,
    "P175": 31,
    "P176": 32,
    "P178": 33,
    "P179": 34,
    "P19": 35,
    "P190": 36,
    "P194": 37,
    "P20": 38,
    "P205": 39,
    "P206": 40,
    "P22": 41,
    "P241": 42,
    "P25": 43,
    "P26": 44,
    "P264": 45,
    "P27": 46,
    "P272": 47,
    "P276": 48,
    "P279": 49,
    "P30": 50,
    "P31": 51,
    "P3373": 52,
    "P35": 53,
    "P355": 54,
    "P36": 55,
    "P361": 56,
    "P364": 57,
    "P37": 58,
    "P39": 59,
    "P40": 60,
    "P400": 61,
    "P403": 62,
    "P449": 63,
    "P463": 64,
    "P488": 65,
    "P495": 66,
    "P50": 67,
    "P527": 68,
    "P54": 69,
    "P551": 70,
    "P569": 71,
    "P57": 72,
    "P570": 73,
    "P571": 74,
    "P576": 75,
    "P577": 76,
    "P58": 77,
    "P580": 78,
    "P582": 79,
    "P585": 80,
    "P6": 81,
    "P607": 82,
    "P674": 83,
    "P676": 84,
    "P69": 85,
    "P706": 86,
    "P710": 87,
    "P737": 88,
    "P740": 89,
    "P749": 90,
    "P800": 91,
    "P807": 92,
    "P840": 93,
    "P86": 94,
    "P937": 95
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.21.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
